EDT/ZUP/zup_edt/src/Documents/РешениеОВозвратеИзОтпускаПоУходуЗаРебенком/РешениеОВозвратеИзОтпускаПоУходуЗаРебенком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РешениеОВозвратеИзОтпускаПоУходуЗаРебенком</name>
  <basedOn>Document.РешениеОбОтпускеПоУходуЗаРебенком</basedOn>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</registerRecords>
  <registerRecords>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РешениеОбОтпускеПоУходуЗаРебенком</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МероприятияАдаптацииУвольнения</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>CatalogRef.МероприятияАдаптацииУвольнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <comment>Плановый срок исполнения задачи</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/РешениеОВозвратеИзОтпускаПоУходуЗаРебенком/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	ОписаниеСостава.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	ОписаниеСостава.ИспользоватьКраткийСостав = Ложь;
	ОписаниеСостава.ЗаполнятьТабличнуюЧастьФизическиеЛицаДокумента = Ложь;
	
	ЗарплатаКадрыСоставДокументов.ДобавитьОписаниеХраненияСотрудниковФизическихЛиц(
		ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц,
		,
		"ФизическоеЛицо",
		"ОсновнойСотрудник");
		
	Возврат ОписаниеСостава;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыЗаполненияМероприятий(Объект) Экспорт
	
	ПараметрыЗаполнения = АдаптацияУвольнение.ПараметрыЗаполненияМероприятий();
	
	ПараметрыЗаполнения.Организация = Объект.Организация;
	ПараметрыЗаполнения.Сотрудник = Объект.ОсновнойСотрудник;
	ПараметрыЗаполнения.ФизическоеЛицо = Объект.ФизическоеЛицо;
	ПараметрыЗаполнения.ДатаСобытия = Объект.ДатаВозврата;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Поля = "ДолжностьПоШтатномуРасписанию,Подразделение,Должность";
	ДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ПараметрыЗаполнения.Сотрудник, Поля, ПараметрыЗаполнения.ДатаСобытия, , Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеСотрудников.Количество() > 0 Тогда
		
		ТекущиеКадровыеДанныеСотрудника = ДанныеСотрудников[0];
		
		ПараметрыЗаполнения.Позиция = ТекущиеКадровыеДанныеСотрудника.ДолжностьПоШтатномуРасписанию;
		ПараметрыЗаполнения.Подразделение = ТекущиеКадровыеДанныеСотрудника.Подразделение;
		ПараметрыЗаполнения.Должность = ТекущиеКадровыеДанныеСотрудника.Должность;
		ПараметрыЗаполнения.ВидСобытия = ВидСобытияАдаптацииУвольнения();
		
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ВидСобытияАдаптацииУвольнения() Экспорт
	
	Возврат АдаптацияУвольнение.СобытиеВозвратИзОтпускаПоУходуЗаРебенком();
	
КонецФункции

Функция ПоляПроверкиУникальности() Экспорт
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить("Организация");
	ПоляПроверки.Добавить("ФизическоеЛицо");
	ПоляПроверки.Добавить("ДокументОснование");
	
	Возврат ПоляПроверки;
	
КонецФункции

Функция СоответствиеРеквизитовОтбораРеквизитамПриказа() Экспорт
	
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить("ФизическоеЛицо", "Сотрудник");
	
	Возврат СоответствиеРеквизитов;
	
КонецФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
